; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v6 - type_1 ?v8 - type_2)
 	      (pred_3 ?v5 - object ?v8 - type_2)
	      (pred_4 ?v6 - type_1 ?v4 - type_3)
	      (pred_1 ?v6 - type_1 ?v5 - object ?v4 - type_3))

   (:action op_1
       :parameters  (?v6 - type_1 ?v2 ?v3 - type_2)
       :precondition (and  (pred_2 ?v6 ?v2))
       :effect (and  (pred_2 ?v6 ?v3)
		     (not (pred_2 ?v6 ?v2))))

   (:action op_3
       :parameters (?v6 - type_1 ?v7 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v1) (pred_2 ?v6 ?v1) (pred_4 ?v6 ?v4))
       :effect (and (pred_1 ?v6 ?v7 ?v4)
		    (not (pred_3 ?v7 ?v1)) 
		    (not (pred_4 ?v6 ?v4))))

   (:action op_2
       :parameters (?v6 - type_1 ?v7 - object ?v1 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v7 ?v4) (pred_2 ?v6 ?v1))
       :effect (and (pred_3 ?v7 ?v1)
		    (pred_4 ?v6 ?v4)
		    (not (pred_1 ?v6 ?v7 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_11 - type_1
obj_03 obj_02 obj_04 obj_12 - type_3
obj_09 obj_07 obj_10 obj_06 - type_2
obj_08 obj_01 obj_05 - object)
(:init
(pred_2 obj_13 obj_06)
(pred_4 obj_13 obj_03)
(pred_4 obj_13 obj_02)
(pred_2 obj_11 obj_07)
(pred_4 obj_11 obj_04)
(pred_4 obj_11 obj_12)
(pred_3 obj_08 obj_07)
(pred_3 obj_01 obj_06)
(pred_3 obj_05 obj_10)
)
(:goal
(and
(pred_3 obj_08 obj_09)
(pred_3 obj_01 obj_07)
(pred_3 obj_05 obj_10)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_13 obj_07) (pred_2 obj_11 obj_07))))
  )
)
)

; plan
1. (op_3 obj_11 obj_08 obj_07 obj_12)
   deleted: (pred_3 obj_08 obj_07) (pred_4 obj_11 obj_12)
   added: (pred_1 obj_11 obj_08 obj_12)
   goals met: 1 of 3
2. (op_3 obj_13 obj_01 obj_06 obj_02)
   deleted: (pred_3 obj_01 obj_06) (pred_4 obj_13 obj_02)
   added: (pred_1 obj_13 obj_01 obj_02)
   goals met: 1 of 3
3. (op_1 obj_11 obj_07 obj_09)
   deleted: (pred_2 obj_11 obj_07)
   added: (pred_2 obj_11 obj_09)
   goals met: 1 of 3
4. (op_1 obj_13 obj_06 obj_07)
   deleted: (pred_2 obj_13 obj_06)
   added: (pred_2 obj_13 obj_07)
   goals met: 1 of 3
5. (op_2 obj_13 obj_01 obj_07 obj_02)
   deleted: (pred_1 obj_13 obj_01 obj_02)
   added: (pred_3 obj_01 obj_07) (pred_4 obj_13 obj_02)
   goals met: 2 of 3
6. (op_2 obj_11 obj_08 obj_09 obj_12)
   deleted: (pred_1 obj_11 obj_08 obj_12)
   added: (pred_3 obj_08 obj_09) (pred_4 obj_11 obj_12)
   goals met: 3 of 3
